templates/template_draft1270_12mps/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| Specific dissipation rate ω                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    wall_barge
    {
        type omegaWallFunction;
        value uniform 1;
    }

    Watersurface
    {
        type omegaWallFunction;
        value uniform 1;
    }

    Inflow
    {
        type atmBoundaryLayerInletOmega;
        Uref 12;
        Zref 10;
        z0   0.01;
        d               uniform 0; 
        value uniform 1;
        zDir (0 0 1);
        flowDir (1 0 0);

    }

    Outflow
    {
        type inletOutlet;
        inletValue uniform 1;
        value      uniform 1;
    }

    Sides
    {
        type zeroGradient;
    }

    Ambient
    {
        type zeroGradient;
    }
}

